### GoogleAds_data Reading

In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.read_csv("D:/Batch 30th/2 SEM/BPS/GoogleAds_DataAnalytics_Sales_Uncleaned.csv")

In [3]:
df.head()

,Ad_ID,Campaign_Name,Clicks,Impressions,Cost,Leads,Conversions,Conversion Rate,Sale_Amount,Ad_Date,Location,Device,Keyword
0,A1000,DataAnalyticsCourse,104.0,4498.0,$231.88,14.0,7.0,0.058,$1892,2024-11-16,hyderabad,desktop,learn data analytics
1,A1001,DataAnalyticsCourse,173.0,5107.0,$216.84,10.0,8.0,0.046,$1679,20-11-2024,hyderabad,mobile,data analytics course
2,A1002,Data Anlytics Corse,90.0,4544.0,$203.66,26.0,9.0,NaN,$1624,2024/11/16,hyderabad,Desktop,data analitics online
3,A1003,Data Analytcis Course,142.0,3185.0,$237.66,17.0,6.0,NaN,$1225,2024-11-26,HYDERABAD,tablet,data anaytics training
4,A1004,Data Analytics Corse,156.0,3361.0,$195.9,30.0,8.0,NaN,$1091,2024-11-22,hyderabad,desktop,online data analytic

In [4]:
df.isnull().sum()

Ad_ID                0
Campaign_Name        0
Clicks             112
Impressions         54
Cost                97
Leads               48
Conversions         74
Conversion Rate    626
Sale_Amount        139
Ad_Date              0
Location             0
Device               0
Keyword              0
dtype: int64

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2600 entries, 0 to 2599
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Ad_ID            2600 non-null   object
 1   Campaign_Name    2600 non-null   object
 2   Clicks           2488 non-null   float64
 3   Impressions      2546 non-null   float64
 4   Cost             2503 non-null   object
 5   Leads            2552 non-null   float64
 6   Conversions      2526 non-null   float64
 7   Conversion Rate  1974 non-null   float64
 8   Sale_Amount      2461 non-null   object
 9   Ad_Date          2600 non-null   object
 10  Location         2600 non-null   object
 11  Device           2600 non-null   object
 12  Keyword          2600 non-null   object
dtypes: float64(5), object(8)
memory usage: 264.2+ KB

### Data Parsing

In [8]:
money_cols = ["Cost", "Sale_Amount"]

for col in money_cols:
    df[col] = (
        df[col].astype(str)
        .str.replace("$", "", regex=False)
        .str.replace(",", "", regex=False)
        .str.strip()
    )
    df[col] = pd.to_numeric(df[col], errors="coerce")

In [9]:
df["Ad_Date"] = pd.to_datetime(
    df["Ad_Date"],
    format="%Y-%m-%d",
    errors="coerce"
)

In [10]:
common_date = df["Ad_Date"].mode()[0]
df["Ad_Date"] = df["Ad_Date"].fillna(common_date)

### Handling missing values in numerical values

In [11]:
mean_cols = ["Clicks", "Impressions", "Leads", "Conversions", "Conversion Rate"]

for col in mean_cols:
    mean_val = df[col].mean()
    df[col] = df[col].fillna(mean_val)

### Handling missing values in Money and Target value

In [12]:
median_cols = ["Cost", "Sale_Amount"]

for col in median_cols:
    median_val = df[col].median()
    df[col] = df[col].fillna(median_val)

In [13]:
df.isnull().sum()

Ad_ID              0
Campaign_Name      0
Clicks             0
Impressions        0
Cost               0
Leads              0
Conversions        0
Conversion Rate    0
Sale_Amount        0
Ad_Date            0
Location           0
Device             0
Keyword            0
dtype: int64

### Text Standardisation

In [14]:
df["Location"] = df["Location"].str.strip().str.title()

In [15]:
df["Device"] = df["Device"].str.lower()

In [16]:
df["Keyword"] = df["Keyword"].str.lower()

In [17]:
df["Location"] = df["Location"].replace({
    "Hyderabd": "Hyderabad",
    "Hyderbad": "Hyderabad",
    "Hydrebad" : "Hyderabad"
})

In [18]:
df["Location"].value_counts()

Location
Hyderabad    2600
Name: count, dtype: int64

In [19]:
# show unique campaign names with their exact length
u = df["Campaign_Name"].dropna().unique()
[(repr(x), len(x)) for x in u]

[("'DataAnalyticsCourse'", 19),
 ("'Data Anlytics Corse'", 19),
 ("'Data Analytcis Course'", 21),
 ("'Data Analytics Corse'", 20)]

In [20]:
df["Campaign_Name"] = (
    df["Campaign_Name"]
    .str.lower()
    .str.replace(r"\s+", "", regex=True)   # remove all spaces
)

In [21]:
df["Campaign_Name"].value_counts()

Campaign_Name
dataanalytciscourse    680
dataanalyticscorse     647
dataanalyticscourse    637
dataanlyticscorse      636
Name: count, dtype: int64

In [22]:
df["Campaign_Name"] = df["Campaign_Name"].replace({
    "dataanalytciscourse": "Data Analytics Course",
    "dataanalyticscorse" : "Data Analytics Course",
    "dataanalyticscourse" : "Data Analytics Course",
    "dataanlyticscorse" : "Data Analytics Course"
})

In [23]:
df["Campaign_Name"].value_counts()

Campaign_Name
Data Analytics Course    2600
Name: count, dtype: int64

In [24]:
df.head()

,Ad_ID,Campaign_Name,Clicks,Impressions,Cost,Leads,Conversions,Conversion Rate,Sale_Amount,Ad_Date,Location,Device,Keyword
0,A1000,Data Analytics Course,104.0,4498.0,231.88,14.0,7.0,0.058000,1892.0,2024-11-16,Hyderabad,desktop,learn data analytics
1,A1001,Data Analytics Course,173.0,5107.0,216.84,10.0,8.0,0.046000,1679.0,2024-11-14,Hyderabad,mobile,data analytics course
2,A1002,Data Analytics Course,90.0,4544.0,203.66,26.0,9.0,0.048979,1624.0,2024-11-14,Hyderabad,desktop,data analitics online
3,A1003,Data Analytics Course,142.0,3185.0,237.66,17.0,6.0,0.048979,1225.0,2024-11-26,Hyderabad,tablet,data anaytics training
4,A1004,Data Analytics Course,156.0,3361.0,195.90,30.0,8.0,0.048979,1091.0,2024-11-22,Hyderabad,desktop,online data analytic

### Checking Duplicate

In [25]:
df.duplicated().sum()

np.int64(0)

### Feature Engineering

In [26]:
df["ROI"] = (df["Sale_Amount"] - df["Cost"]) / df["Cost"]

In [27]:
df["Cost_per_Conversion"] = df["Cost"] / df["Conversions"]

In [28]:
df.head()

,Ad_ID,Campaign_Name,Clicks,Impressions,Cost,Leads,Conversions,Conversion Rate,Sale_Amount,Ad_Date,Location,Device,Keyword,ROI,Cost_per_Conversion
0,A1000,Data Analytics Course,104.0,4498.0,231.88,14.0,7.0,0.058000,1892.0,2024-11-16,Hyderabad,desktop,learn data analytics,7.159393,33.125714
1,A1001,Data Analytics Course,173.0,5107.0,216.84,10.0,8.0,0.046000,1679.0,2024-11-14,Hyderabad,mobile,data analytics course,6.743036,27.105000
2,A1002,Data Analytics Course,90.0,4544.0,203.66,26.0,9.0,0.048979,1624.0,2024-11-14,Hyderabad,desktop,data analitics online,6.974074,22.628889
3,A1003,Data Analytics Course,142.0,3185.0,237.66,17.0,6.0,0.048979,1225.0,2024-11-26,Hyderabad,tablet,data anaytics training,4.154422,39.610000
4,A1004,Data Analytics Course,156.0,3361.0,195.90,30.0,8.0,0.048979,1091.0,2024-11-22,Hyderabad,desktop,online data analytic,4.569168,24.487500

### Binning

In [8]:
import pandas as pd
df = pd.read_csv("Google_Ads_Cleaned.csv")

In [9]:
df["Click_Level"] = pd.qcut(
    df["Clicks"],
    q=3,
    labels=["Low", "Medium", "High"]
)

In [10]:
df["Cost_Level"] = pd.qcut(
    df["Cost"],
    q=3,
    labels=["Low", "Medium", "High"]
)

In [16]:
df["Cost_per_Conversion_Level"] = pd.qcut(
    df["Cost_per_Conversion"],
    q=3,
    labels=["Low", "Medium", "High"]
)

In [19]:
df["Impressions_Level"] = pd.qcut(
    df["Impressions"],
    q=3,
    labels=["Low", "Medium", "High"]
)

### Final Validation Check

In [20]:
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2600 entries, 0 to 2599
Data columns (total 21 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Unnamed: 0                 2600 non-null   int64
 1   Ad_ID                      2600 non-null   object
 2   Campaign_Name              2600 non-null   object
 3   Clicks                     2600 non-null   float64
 4   Impressions                2600 non-null   float64
 5   Cost                       2600 non-null   float64
 6   Leads                      2600 non-null   float64
 7   Conversions                2600 non-null   float64
 8   Conversion Rate            2600 non-null   float64
 9   Sale_Amount                2600 non-null   float64
 10  Ad_Date                    2600 non-null   object
 11  Location                   2600 non-null   object
 12  Device                     2600 non-null   object
 13  Keyword                    2600 non-null   object
 14  ROI                        2600 non-null   float64
 15  Cost_per_Conversion        2600 non-null   float64
 16  Click_Level                2600 non-null   category
 17  Cost_Level                 2600 non-null   category
 18  Cost_per_Conversion_Level  2600 non-null   category
 19  ROI_Level                  2600 non-null   category
 20  Impressions_Level          2600 non-null   category
dtypes: category(5), float64(9), int64(1), object(6)
memory usage: 338.5+ KB

Unnamed: 0                   0
Ad_ID                        0
Campaign_Name                0
Clicks                       0
Impressions                  0
Cost                         0
Leads                        0
Conversions                  0
Conversion Rate              0
Sale_Amount                  0
Ad_Date                      0
Location                     0
Device                       0
Keyword                      0
ROI                          0
Cost_per_Conversion          0
Click_Level                  0
Cost_Level                   0
Cost_per_Conversion_Level    0
ROI_Level                    0
Impressions_Level            0
dtype: int64

### Write cleaned dataset

In [21]:
df.to_csv("D:/Batch 30th/2 SEM/BPS/Google_Ads_Cleaned.csv")